[
  {
    "id": 1,
    "title": "Data Analyst",
    "company": "Eco Servant Projects Organization",
    "date": "Jul 2025 - Present",
    "description": "Evaluated Google Analytics data from 50K+ monthly visitors, uncovering engagement trends that enhanced ocean conservation campaign strategies. Verified 100K+ data points monthly, enhancing report reliability and supporting actionable insights for stakeholder presentations. Cooperated with stakeholders on 5 conservation projects, performing exploratory data analysis using Python and Pandas, improving campaign targeting effectiveness by 20%. Generated client-ready reports and visualizations using Power BI and Excel, delivering insights that guided a 15% increase in campaign engagement.",
    "icon": "/default-company.png",
    "iconBg": "#2A9D8F"
  },
  {
    "id": 2,
    "title": "Data Analyst",
    "company": "Musigma Business Solutions Limited",
    "date": "Jan 2022 - Jul 2023",
    "description": "Engineered comprehensive ETL pipelines using Azure Data Factory, processing 10M+ daily records and improving multi-source reporting accuracy. Executed a Global Consolidated Power BI dashboard with advanced DAX, integrated with Azure cloud, tracking KPIs across 40 regions and reducing reporting time by 40%. Developed data workflows using Databricks, PyCharm, and Azure Data Lake Storage, leveraging Spark to automate data processing. Directed Agile teams of 8, managing sprint planning, backlog prioritization, and delivery. Enhanced SQL queries and data models, improving dashboard load times by 50%.",
    "icon": "/default-company.png",
    "iconBg": "#4b6cb7"
  },
  {
    "id": 3,
    "title": "Junior Data Analyst",
    "company": "Musigma Business Solutions Limited",
    "date": "Sep 2020 - Dec 2021",
    "description": "Evaluated operational and customer data to identify workflow inefficiencies, delivering data-driven insights that improved process efficiency and informed strategic business decisions. Executed A/B tests for 3 product features, guiding stakeholders to select the highest-impact variants, increasing user engagement on digital platforms by 15%. Optimized data preprocessing and cleaning workflows for 500K+ records, reducing inconsistencies and improving reliability of analytics outputs. Constructed ad-hoc data marts and reporting solutions using SQL, Python, and Power BI, streamlining ETL pipelines and reducing reporting turnaround time by 30%.",
    "icon": "/default-company.png",
    "iconBg": "#6366f1"
  }
]
